<a href="https://colab.research.google.com/github/ckalibsnelson/Node-Lite/blob/master/data_manipulation_exercises_dogtags.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Dog Tags Exercises

If you want to work on these on your own go to File -> Save a copy in Drive... to work on these exercises for yourself.

If you want to find where the file was saved in your drive use File -> Locate in Drive

In [0]:
import pandas as pd

In [0]:
#Change header
dogs = pd.read_csv('https://raw.githubusercontent.com/benartuso/nodef19/master/data/01-intro-to-pandas/dog_tags.csv', header = 0)
dogs.head()

   RecordID  FeeAmount  ... TagYear BlockNumber
0         1          4  ...    2016      1100.0
1         2          4  ...    2016      1000.0
2         3          4  ...    2015      1000.0
3         4         12  ...    2013     11000.0
4         5          4  ...    2015       700.0

[5 rows x 8 columns]

In [0]:
#renaming columns
dogs.columns = ['id', 'fee', 'exp_date', 'street', 'number', 'type', 'year', 'block']
dogs.head(5)

   id  fee                  exp_date  ...                       type  year    block
0   1    4  2016-08-13T04:00:00.000Z  ...  Unsexed - 1 Year           2016   1100.0
1   2    4  2017-03-15T04:00:00.000Z  ...  Unsexed - 1 Year           2016   1000.0
2   3    4  2016-10-25T04:00:00.000Z  ...  Unsexed - 1 Year           2015   1000.0
3   4   12  2016-07-04T04:00:00.000Z  ...  Unsexed - 3 Year           2013  11000.0
4   5    4  2018-08-02T04:00:00.000Z  ...  Unsexed - 1 Year           2015    700.0

[5 rows x 8 columns]

# Pandas Exercises


1.   How many tags are given for each year? 
2.   How much money was spent in 2015 on dog tags?
3.   Use the .describe() function on the dataframe. What do you see? Why do you think some columns don't have means/other summary stats? Write this in a comment.

In [0]:
dogs.head()

   id  fee                  exp_date  ...                       type  year    block
0   1    4  2016-08-13T04:00:00.000Z  ...  Unsexed - 1 Year           2016   1100.0
1   2    4  2017-03-15T04:00:00.000Z  ...  Unsexed - 1 Year           2016   1000.0
2   3    4  2016-10-25T04:00:00.000Z  ...  Unsexed - 1 Year           2015   1000.0
3   4   12  2016-07-04T04:00:00.000Z  ...  Unsexed - 3 Year           2013  11000.0
4   5    4  2018-08-02T04:00:00.000Z  ...  Unsexed - 1 Year           2015    700.0

[5 rows x 8 columns]

### 1. How many tags are given for each year?

In [0]:
#answer question 1 here

### 2. How much money was spent in 2015 on dog tags?

In [0]:
#answer question 2 here
#hint: use the sum function at the end to find the total!

### 3. Use the .describe() function on the dataframe. What do you see? Why do you think some columns don't have means/other summary stats? Write this in a comment.

In [0]:
#answer question 3 here

# Pandas Exercises Solutions

### 1. How many tags are given for each year?

In [0]:
dogs['year'].value_counts()

2012    2245
2013    2183
2015    2006
2014    1929
2011    1901
2018    1896
2016    1833
2017    1611
2010    1490
2019    1241
2009       2
Name: year, dtype: int64

### 2. How much money was spent on dog tags in 2015?

In [0]:
tags_2015 = dogs[dogs['year'] == 2015]
fees_2015 = tags_2015['fee']
sum(fees_2015)

15170

### 3. Use the .describe() function on the dataframe. What do you see? Why do you think some columns don't have means/other summary stats? Write this in a comment.

In [0]:
dogs.describe()

                 id           fee        number          year         block
count  18337.000000  18337.000000  18335.000000  18337.000000  18328.000000
mean    9169.000000      7.380378  36622.870194   2014.324371   1494.789393
std     5293.580279      4.611274  10810.645863      2.717729   3196.291847
min        1.000000      0.000000      0.000000   2009.000000      0.000000
25%     4585.000000      4.000000  26035.500000   2012.000000    500.000000
50%     9169.000000      4.000000  38541.000000   2014.000000   1000.000000
75%    13753.000000     12.000000  44342.000000   2017.000000   1600.000000
max    18337.000000    150.000000  93963.000000   2019.000000  82600.000000